; domain
(define (domain ai_game)
	(:requirements :strips :typing :fluents :conditional-effects)
	(:types 	
		place - object		 
		person - object
		building - place
		forest - place
		resource - place		
		
	)
	
	(:functions
		(wood)
		(timber)
		(iron)
		(stone)
		(rifles)
		(stored-ore)
		(stored-coal)	
		(ore ?p - place)
		(coal ?p - place)
		(min_resource)		
		(time)
		(riflemen)
		(population)
	)
	
	(:predicates
		(at ?person - person ?p - place)
		(has-building ?p - place)
		
		(has-house ?p - place)
		(has-sawmill ?p - place)
		(has-smelter ?p - place)
		(has-school ?p - place)
		(has-storage ?p - place)
		(has-oremine ?p - place)
		(has-coalmine ?p - place)
		(has-quarry ?p - place)
		(has-blacksmith ?p - place)
		(has-barracks ?p - place)
		(has-skill ?person - person)
		(has-riflemanskill ?person - person)
		(has-rifle ?person - person)
		
		(ore_resource ?p - place)
		(coal_resource ?p - place)
		
		(has-turfhut ?p - place)
		
		(has-timber ?person - person)
		(has-wood ?person - person)
		(has-coal ?person - person)
		(has-ore ?person - person)
		(has-iron ?person - person)
		(has-stone ?person - person)
		(has-axe ?person - person)

		(is-carpenter ?person - person)
		(is-blacksmith ?person - person)
		(is-lumberjack ?person - person)
		(is-teacher ?person - person)
		(is-miner ?person - person)
		(is-rifleman ?person - person)			
	)
	
	;; ------------- ACTIONS ---------- ;;
	
	(:action move
			:parameters (?person - person ?pl-from ?pl-to - place)
			:precondition (and (at ?person ?pl-from))
			:effect(and(at ?person ?pl-to) (not (at ?person ?pl-from)))
	)
	
	(:action reproduceTurfHut
			:parameters (?person1 - person ?person2 - person ?place - place)
			:precondition(and (at ?person1 ?place) (at ?person2 ?place) (not (= ?person1 ?person2)) (has-turfhut ?place))
			:effect(and (increase (population) 1))
	)
	
	(:action reproduceHouse
			:parameters(?person1 - person ?person2 - person ?place - place)
			:precondition(and (at ?person1 ?place) (at ?person2 ?place) (not (= ?person1 ?person2)) (has-house ?place))
			:effect(and (increase (population) 1))
	)

	;;------------- Training ------------- ;;
	
	(:action simpleEducate
			:parameters(?person - person ?student - person ?place - place)
			:precondition(and(at ?person ?place) (at ?student ?place) (not(has-skill ?student)) (not(= ?person ?student)))
			:effect(and (has-skill ?student) (increase (time) 100))
	)
	
	(:action schoolEducate
			:parameters(?student - person ?teacher - person ?place - place)
			:precondition(and(at ?student ?place) (at ?teacher ?place) (is-teacher ?teacher) (has-school ?place) (not(has-skill ?student)))
			:effect(and (has-skill ?student) (increase (time) 50))
	)
	
	(:action barracksEducate
			:parameters(?student - person ?teacher - person ?place - place)
			:precondition(and(at ?student ?place) (at ?teacher ?place) (is-teacher ?teacher) (has-barracks ?place))
			:effect(and (has-riflemanskill ?student) (increase (time) 30))
	)
	
	(:action trainCarpenter
			:parameters(?person - person)
			:precondition(and(has-skill ?person) (not(is-carpenter ?person)))
			:effect(and (is-carpenter ?person) (not(has-skill ?person)))
	)
	
	(:action trainBlacksmith
			:parameters(?person - person)
			:precondition(and(has-skill ?person) (not(is-blacksmith ?person)))
			:effect(and (is-blacksmith ?person) (not(has-skill ?person)))
	)
	
	(:action trainLumberjack
			:parameters(?person - person)
			:precondition(and(has-skill ?person) (not(is-lumberjack ?person)))
			:effect(and (is-lumberjack ?person) (not(has-skill ?person)))
	)
	
	(:action trainTeacher
			:parameters(?person - person)
			:precondition(and(has-skill ?person) (not(is-teacher ?person)))
			:effect(and (is-teacher ?person) (not(has-skill ?person)))
	)

	(:action trainMiner
			:parameters(?person - person)
			:precondition(and(has-skill ?person) (not(is-miner ?person)))
			:effect(and (is-miner ?person) (not(has-skill ?person)))
	)
	
	(:action trainRifleman
			:parameters(?person - person)
			:precondition(and(has-riflemanskill ?person) (not(is-rifleman ?person)) (>= (rifles) 1))
			:effect(and (is-rifleman ?person) (not(has-riflemanskill ?person)) (increase (riflemen) 1) (decrease (rifles) 1))
	)
	
	;; --------- Acquire Resource --------- ;;
	
	(:action cutTree
			:parameters(?lumberjack - person ?tree - forest)
			:precondition(and(is-lumberjack ?lumberjack) (at ?lumberjack ?tree))
			:effect(has-timber ?lumberjack)
	)
	
	(:action simpleMineOre
			:parameters(?person - person ?resource - resource)
			:precondition(and(> (ore ?resource) (min_resource)))
			:effect(and(has-ore ?person) (decrease (ore ?resource) 1))
	)
	
	(:action simpleMineCoal
			:parameters(?person - person ?resource - resource)
			:precondition(and(> (coal ?resource) (min_resource)))
			:effect(and(has-coal ?person) (decrease (coal ?resource) 1))
	)	
	
	(:action mineOre
			:parameters(?miner - person ?mine - place)
			:precondition(and(is-miner ?miner) (at ?miner ?mine) (has-oremine ?mine))
			:effect(has-ore ?miner)
	)
	
	(:action mineCoal
			:parameters(?miner - person ?mine - place)
			:precondition(and(is-miner ?miner) (at ?miner ?mine) (has-coalmine ?mine))
			:effect(has-coal ?miner)
	)

	(:action cutStone
			:parameters(?stonecutter - person ?quarry - place)
			:precondition(and(at ?stonecutter ?quarry) (has-quarry ?quarry))
			:effect(has-stone ?stonecutter)
	)	
	
	(:action produceWood
			:parameters(?person - person ?sawmill - place)
			:precondition(and (at ?person ?sawmill) (has-sawmill ?sawmill) (>= (timber) 1))
			:effect(and(has-wood ?person) (decrease (timber) 1))
	)
	
	(:action produceIron
			:parameters(?person - person ?smelter - place)
			:precondition(and(>= (stored-coal) 1) (>= (stored-ore) 1) (at ?person ?smelter) (has-smelter ?smelter))
			:effect(and(has-iron ?person) (decrease (stored-ore) 1) (decrease (stored-coal) 1))
	)
	
	(:action produceTool
			:parameters(?blacksmith - person ?place - place)
			:precondition(and(at ?blacksmith ?place) (is-blacksmith ?blacksmith) (has-blacksmith ?place))
			:effect(has-rifle ?blacksmith)
	)
	
	;; --------- Build Building ---------- ;;
	
	(:action buildTurfHut
			:parameters(?person - person ?place - place)
			:precondition(and(at ?person ?place)  (not(has-building ?place)))
			:effect(and(has-turfhut ?place) (has-building ?place))
	)
	
	(:action buildHouse
			:parameters(?carpenter - person ?person - person ?place - place)
			:precondition(and(at ?carpenter ?place) (at ?person ?place) (is-carpenter ?carpenter)  (not(has-building ?place)) (not(= ?person ?carpenter))
						  (>= (wood) 1))
			:effect(and(has-house ?place) (has-building ?place) (decrease (wood) 1))
	)
	
	(:action buildSmelter
			:parameters(?person - person ?place - place)
			:precondition(and(at ?person ?place)  (not(has-building ?place)) 
						  (>= (stone) 1))
			:effect(and(has-smelter ?place) (has-building ?place) (decrease (stone) 1))
	)
	
	(:action buildSchool
			:parameters(?carpenter - person ?person - person ?place - place)
			:precondition(and(at ?person ?place) (at ?carpenter ?place) (is-carpenter ?carpenter) (not(has-building ?place))  (not(= ?person ?carpenter))
						  (>= (iron) 1)
						  (>= (wood) 1)
						  (>= (stone) 1))						  
			:effect(and(has-school ?place) (has-building ?place) (decrease (iron) 1) (decrease (wood) 1) (decrease (stone) 1))
	)
	
	(:action buildSawMill
			:parameters(?person - person ?place - place)
			:precondition(and(at ?person ?place) (not(has-building ?place)) 
						  (>= (stone) 1) 
						  (>= (timber) 1) 
						  (>= (iron) 1))
			:effect(and(has-sawmill ?place) (has-building ?place) (decrease (stone) 1) (decrease (iron) 1) (decrease (timber) 1))
	)
	
	(:action buildBlacksmith
			:parameters(?person - person ?place - place)
			:precondition(and(at ?person ?place) (not(has-building ?place))
						  (>= (stone) 1) 
						  (>= (timber) 1) 
						  (>= (iron) 1))
			:effect(and(has-blacksmith ?place) (has-building ?place) (decrease (stone) 1) (decrease (iron) 1) (decrease (timber) 1))
	)
	
	(:action buildOreMine
			:parameters(?carpenter - person ?blacksmith - person ?person - person ?resource - resource)
			:precondition(and(is-carpenter ?carpenter) (is-blacksmith ?blacksmith) (at ?carpenter ?resource) (at ?blacksmith ?resource) (ore_resource ?resource) (not(= ?carpenter ?blacksmith)) (not(has-oremine ?resource))
						  (>= (wood) 1)
						  (>= (iron) 1))
			:effect(and(has-oremine ?resource) (has-building ?resource) (decrease (wood) 1) (decrease (iron) 1))
	)
	
	(:action buildCoalMine
			:parameters(?carpenter - person ?blacksmith - person ?person - person ?resource - resource)
			:precondition(and(is-carpenter ?carpenter) (is-blacksmith ?blacksmith) (at ?carpenter ?resource) (at ?blacksmith ?resource) (coal_resource ?resource) (not (= ?carpenter ?blacksmith)) (not(has-coalmine ?resource))
						  (>= (wood) 1)
						  (>= (iron) 1))
			:effect(and(has-coalmine ?resource) (has-building ?resource) (decrease (wood) 1) (decrease (iron) 1))
	)		
	
	(:action buildBarracks
			:parameters(?carpenter - person ?person - person ?place - place)
			:precondition(and(is-carpenter ?carpenter) (at ?carpenter ?place) (at ?person ?place) (not(= ?carpenter ?person)) (not(has-building ?place))
						  (>= (stone) 1)
						  (>= (wood) 1))
			:effect(and (has-barracks ?place) (has-building ?place) (decrease (stone) 1) (decrease (wood) 1))
	)
	
	(:action buildQuarry
			:parameters(?person - person ?place - place)
			:precondition(and(at ?person ?place) (not(has-building ?place)))
			:effect(and (has-quarry ?place))
	)
	
	;; --------- Store Resource ---------- ;;
	
	(:action storeTimber
			:parameters(?person - person ?storage - place)
			:precondition(and(at ?person ?storage) (has-storage ?storage) (has-timber ?person))
			:effect(and (increase (timber) 1) (not(has-timber ?person)))
	)

	(:action storeWood
			:parameters(?person - person ?storage - place)
			:precondition(and(at ?person ?storage) (has-storage ?storage) (has-wood ?person))
			:effect(and (increase (wood) 1) (not(has-wood ?person)))
	)
	
	(:action storeOre
			:parameters(?person - person ?storage - place)
			:precondition(and(at ?person ?storage) (has-storage ?storage) (has-ore ?person))
			:effect(and (increase (stored-ore) 1) (not(has-ore ?person)))
	)
	
	(:action storeCoal
			:parameters(?person - person ?storage - place)
			:precondition(and(at ?person ?storage) (has-storage ?storage) (has-coal ?person))
			:effect(and (increase (stored-coal) 1) (not(has-coal ?person)))
	)
	
	(:action storeIron
			:parameters(?person - person ?storage - place)
			:precondition(and (at ?person ?storage) (has-storage ?storage) (has-iron ?person))
			:effect(and (increase (iron) 1) (not (has-iron ?person)))
	)
	
	(:action storeStone
			:parameters(?person - person ?storage - place)
			:precondition(and (at ?person ?storage) (has-storage ?storage) (has-stone ?person))
			:effect(and (increase (stone) 1) (not (has-stone ?person)))
	)
	
	;;store Rifle ? best way of doing this?
	(:action storeRifle
			:parameters(?person - person ?storage - place)
			:precondition(and (at ?person ?storage) (has-storage ?storage) (has-rifle ?person))
			:effect(and (increase (rifles) 1) (not (has-rifle ?person)))
	)
)

; problem
(define (problem team_problem)
(:domain ai_game)
(:objects
forest1 - forest
Human3 - person
Human3place - place
Human4 - person
Human4place - place
oreresource - resource
coalresource - resource
quarry - place
storage - place
)
(:init
(at Human3 Human3place)
(at Human4 Human4place)
(ore_resource oreresource)
(coal_resource coalresource)
(has-building oreresource)
(has-building coalresource)
(has-storage storage)
(has-building storage)
(= (time) 0)
(= (wood) 0)
(= (iron) 0)
(= (timber) 0)
(= (stored-ore) 0)
(= (stored-coal) 0)
(= (rifles) 0)
(= (riflemen) 0)
(= (stone) 0)
(= (population) 2)
(= (min_resource) 0)
(= (ore oreresource) 5)
(= (coal coalresource) 5)
)
(:goal
(and
(has-sawmill Human3place)

)
)
)

; plan
1. (buildquarry human4 human4place)
   added: (has-quarry human4place)
   goals met: 0 of 1
2. (cutstone human4 human4place)
   added: (has-stone human4)
   goals met: 0 of 1
3. (move human3 human3place human4place)
   deleted: (at human3 human3place)
   added: (at human3 human4place)
   goals met: 0 of 1
4. (simpleeducate human3 human4 human4place)
   added: (has-skill human4)
   changed: (time) from 0 to 100
   goals met: 0 of 1
5. (move human4 human4place forest1)
   deleted: (at human4 human4place)
   added: (at human4 forest1)
   goals met: 0 of 1
6. (move human4 forest1 storage)
   deleted: (at human4 forest1)
   added: (at human4 storage)
   goals met: 0 of 1
7. (storestone human4 storage)
   deleted: (has-stone human4)
   changed: (stone) from 0 to 1
   goals met: 0 of 1
8. (move human4 storage forest1)
   deleted: (at human4 storage)
   added: (at human4 forest1)
   goals met: 0 of 1
9. (buildsmelter human4 forest1)
   added: (has-smelter forest1) (has-building forest1)
   changed: (stone) from 1 to 0
   goals met: 0 of 1
10. (simplemineore human4 oreresource)
   added: (has-ore human4)
   changed: (ore oreresource) from 5 to 4
   goals met: 0 of 1
11. (simpleminecoal human4 coalresource)
   added: (has-coal human4)
   changed: (coal coalresource) from 5 to 4
   goals met: 0 of 1
12. (move human4 forest1 storage)
   deleted: (at human4 forest1)
   added: (at human4 storage)
   goals met: 0 of 1
13. (storecoal human4 storage)
   deleted: (has-coal human4)
   changed: (stored-coal) from 0 to 1
   goals met: 0 of 1
14. (storeore human4 storage)
   deleted: (has-ore human4)
   changed: (stored-ore) from 0 to 1
   goals met: 0 of 1
15. (trainlumberjack human4)
   deleted: (has-skill human4)
   added: (is-lumberjack human4)
   goals met: 0 of 1
16. (move human4 storage forest1)
   deleted: (at human4 storage)
   added: (at human4 forest1)
   goals met: 0 of 1
17. (produceiron human4 forest1)
   added: (has-iron human4)
   changed: (stored-ore) from 1 to 0, (stored-coal) from 1 to 0
   goals met: 0 of 1
18. (cuttree human4 forest1)
   added: (has-timber human4)
   goals met: 0 of 1
19. (cutstone human3 human4place)
   added: (has-stone human3)
   goals met: 0 of 1
20. (move human4 forest1 storage)
   deleted: (at human4 forest1)
   added: (at human4 storage)
   goals met: 0 of 1
21. (move human3 human4place storage)
   deleted: (at human3 human4place)
   added: (at human3 storage)
   goals met: 0 of 1
22. (storetimber human4 storage)
   deleted: (has-timber human4)
   changed: (timber) from 0 to 1
   goals met: 0 of 1
23. (storeiron human4 storage)
   deleted: (has-iron human4)
   changed: (iron) from 0 to 1
   goals met: 0 of 1
24. (move human4 storage human3place)
   deleted: (at human4 storage)
   added: (at human4 human3place)
   goals met: 0 of 1
25. (storestone human3 storage)
   deleted: (has-stone human3)
   changed: (stone) from 0 to 1
   goals met: 0 of 1
26. (buildsawmill human4 human3place)
   added: (has-sawmill human3place) (has-building human3place)
   changed: (stone) from 1 to 0, (iron) from 1 to 0, (timber) from 1 to 0
   goals met: 1 of 1
